# 1. Create data Frame

1.1 input dict

In [1]:
import pandas as pd
data = {
    'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
    'year':[2000,2001,2002,2001,2002],
    'pop':[1.5,1.7,3.6,2.4,2.9]
}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

DataFrame query: row-> index, column-> columns

In [2]:
frame2 = pd.DataFrame(data,index=['one','two','three','four','five'],columns=['year','state','pop','debt'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

How to query the DataFrame data

| Query | keywords   |
|:------|:------|
|   row  | index|
|   column  | columns|
|   value  | values|

In [3]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan]], dtype=object)

1.2 input csv/txt file

read_csv, read_table

|   Parameters |meaning   |
|:------|:------|
|   header  |default 1st row is header; set header=None, all are data, no header    |
|   index_col  |default 1st column is index; set index_col=-1, no column index    |
|   nrows  |numbers of rows read    |
|   sep/delimiter  |default read_csv is ",", read_table is "\t"    |
|   encoding  |-    |

## 2. DataFrame axis

| axis | meaning   |
|:------|:------|
|   axis=0  | row|
|   axis=1  | column|

### 2.1 Index & Slice

query multiple rows and columns

In [4]:
import numpy as np
df = pd.DataFrame(np.arange(16).reshape((4,4)),index = ['Ohio','Colorado','Utah','New York'],\
                    columns=['one','two','three','four'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [5]:
# query multiple columns
df[['one','two']]

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [6]:
# query multiple rows
df[0:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [7]:
# query multiple rows according to logics 1
df[df['three']>3]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [8]:
# # query multiple rows according to regex
# data1 = {'model': ['Lisa', 'Lisa 2', 'Macintosh 128K', 'Macintosh 512K'],
#         'launched': [1983,1984,1984,1984],
#         'discontinued': [1986, 1985, 1984, 1986]}

# df1 = pd.DataFrame(data1, columns = ['model', 'launched', 'discontinued'])
# df1 = df1[df1['model'].str.contains('ac')]
# #df1 = df1[df1['model'].str.match('Mac')]
# df1

In [17]:
# query multiple rows according to logics 2
df[df['three']>3]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [35]:
# query muliple rows combining multiple logics
df[(df['three'] > 3) & (df['one'] > 4) ]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [36]:
# query muliple rows with keywords
df.loc[df['three'].isin([10,14,2])]

          one  two  three  four
Ohio        0    1      2     3
Utah        8    9     10    11
New York   12   13     14    15

In [37]:
# query muliple rows without keywords
df.loc[~df['three'].isin([10,14,2])]

          one  two  three  four
Colorado    4    5      6     7

###### loc, iloc difference

| axis | meaning   |
|:------|:------|
|   loc  | gets rows (or columns) with particular labels from the index|
|   iloc  | gets rows (or columns) at particular positions in the index(so it only takes integers)|

iloc works based on interger position

df.iloc[0] always returns the 1st row

df.iloc[-5:] always returns the last 5 rows

df.iloc[:,2] always returns 3rd column

df.loc['a']

df.loc['b':, 'date']

In [43]:
# Example 1
# s.iloc[:3] returns us the first 3 rows(since it treats 3 as a position)
# s.loc[:3] returns us the first 8 rows(since it treats 3 as a lable)
s = pd.DataFrame(1, index=[49,48,47,46,45, 1, 2, 3, 4, 5],\
                    columns=['one','two','three','four'])
s.iloc[:3]

    one  two  three  four
49    1    1      1     1
48    1    1      1     1
47    1    1      1     1

In [44]:
s.loc[:3]

    one  two  three  four
49    1    1      1     1
48    1    1      1     1
47    1    1      1     1
46    1    1      1     1
45    1    1      1     1
1     1    1      1     1
2     1    1      1     1
3     1    1      1     1

### 2.2 Change data

#### 2.2.1 use value to change

In [53]:
data = {
    'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
    'year':[2000,2001,2002,2001,2002],
    'pop':[1.5,1.7,3.6,2.4,2.9]
}
frame2 = pd.DataFrame(data,index=['one','two','three','four','five'],columns=['year','state','pop','debt'])
frame2['debt']=16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

#### 2.2.2 use list to change

In [54]:
# the length of list should be the same to the length of column
frame2.debt = np.arange(5)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

#### 2.2.3 use Series to change

In [55]:
# it will update the df using row index
val = pd.Series([-1.2,-1.5,-1.7], index=['two','four','five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

### 2.3 reindex

In [57]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),index=[1,4,5],columns=['Ohio','Texas','California'])
frame2 = frame.reindex([1,2,4,5])
frame2

   Ohio  Texas  California
1   0.0    1.0         2.0
2   NaN    NaN         NaN
4   3.0    4.0         5.0
5   6.0    7.0         8.0

In [58]:
states = ['Texas','Utah','California']
frame.reindex(columns=states)

   Texas  Utah  California
1      1   NaN           2
4      4   NaN           5
5      7   NaN           8

In [60]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),index = ['a','c','d'],columns = ['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

### 2.3 drop

In [63]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [66]:
# drop rows
df.drop('Ohio')

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [71]:
# drop columns
df.drop(['one','two'],axis=1)

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

### 2.4 functions

#### 2.4.1 using numpy

In [77]:
frame = pd.DataFrame(np.random.randn(3,3),columns=list('bcd'),index=['Ohio','Texas','Colorado'])
np.max(frame, axis=1)

Ohio       -0.342652
Texas       0.122891
Colorado    0.222020
dtype: float64

In [75]:
np.max(frame)

b    1.248967
c    1.575943
d    1.003635
dtype: float64

In [76]:
np.abs(frame)

                 b         c         d
Ohio      1.248967  0.061334  0.657036
Texas     1.245107  0.435289  1.003635
Colorado  0.726365  1.575943  0.643740

#### 2.4.2 using function for row or column

In [80]:
f = lambda x:x.max() - x.min()
frame.apply(f)

b    1.480665
c    2.022560
d    0.564672
dtype: float64

In [81]:
frame.apply(f, axis=1)

Ohio        1.871037
Texas       0.710943
Colorado    1.986004
dtype: float64

### 2.5 sort

#### 2.5.1 sort based on index/columns

In [86]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [85]:
df.sort_index()

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15
Ohio        0    1      2     3
Utah        8    9     10    11

In [88]:
df.sort_index(1, ascending=False)

          two  three  one  four
Ohio        1      2    0     3
Colorado    5      6    4     7
Utah        9     10    8    11
New York   13     14   12    15

#### 2.5.1 sort based on values of multiple columns

In [91]:
# df.sort_values(by=['two', 'one'])
df.sort_values(by=['two', 'one'], ascending=False)

          one  two  three  four
New York   12   13     14    15
Utah        8    9     10    11
Colorado    4    5      6     7
Ohio        0    1      2     3

### 2.6 aggregate and statistics

#### 2.6.1 sum, mean, max

In [92]:
df.sum()

one      24
two      28
three    32
four     36
dtype: int64

In [95]:
df.sum(axis=1)

Ohio         6
Colorado    22
Utah        38
New York    54
dtype: int64

### 2.7 deal missing value

| fuction | meaning   |
|:------|:------|
|   isnull  | check if it is null|
|   fillna  | fill if it is null|
|   dropna  | drop if it is null|

In [106]:
f = pd.DataFrame([[1,6.5,3],[1,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.5,3]])
f

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [107]:
f.dropna()

     0    1    2
0  1.0  6.5  3.0

In [108]:
f.dropna(how="all",axis=1,inplace=False)
f

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [113]:
f.fillna({1:"fill_1",2:"fill_2"})

     0       1       2
0  1.0     6.5       3
1  1.0  fill_1  fill_2
2  NaN  fill_1  fill_2
3  NaN     6.5       3

In [114]:
f.fillna(method="ffill")

     0    1    2
0  1.0  6.5  3.0
1  1.0  6.5  3.0
2  1.0  6.5  3.0
3  1.0  6.5  3.0

Reference：

1.https://www.jianshu.com/p/8024ceef4fe2

2.https://stackoverflow.com/questions/17071871/how-to-select-rows-from-a-dataframe-based-on-column-values

3.https://davidhamann.de/2017/06/26/pandas-select-elements-by-string/

4.https://stackoverflow.com/questions/31593201/how-are-iloc-ix-and-loc-different
5.https://stackoverflow.com/questions/17071871/how-to-select-rows-from-a-dataframe-based-on-column-values